---
kind: property
id: P:Autodesk.Revit.DB.PlanCircuit.SideNum
source: html/37b256c7-0240-12c5-5a10-84713d0b0a13.htm
---
# Autodesk.Revit.DB.PlanCircuit.SideNum Property

The number of sides in the circuit.

## Syntax (C#)
```csharp
public int SideNum { get; }
```